DataProcessors/гз_АнализДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>гз_АнализДоговора</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гз_ОбъявлениеОПроведенииГосударственныхЗакупок</v8:Type>
						<v8:Type>cfg:CatalogRef.гз_ПроведенныеЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарубежныйПоставщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерШтрафа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СостоянияДоговоровПоГосударственнымЗакупкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗакупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_СпособыЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СпособыОплатыПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаШтрафа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СпособыРасчетаШтрафа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субподрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубъектМалогоПредпринимательства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товаропроизводитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гз_КорректировкиДоговоровГосударственныхЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>гз_КорректировкиДоговоровГосударственныхЗакупок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок</Name>
			<Comment>(гз)</Comment>
			<BasedOn>
				<xr:Item>Document.гз_РегистрацияДоговораПоГосударственнымЗакупкам</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.гз_ДвижениеНоменклатурыПоДоговорам</xr:Item>
				<xr:Item>InformationRegister.гз_СтатусыДоговоровПоГосударственнымЗакупкам</xr:Item>
				<xr:Item>AccumulationRegister.гз_ДвижениеНоменклатурыПоДоговорамПоМестамПоставки</xr:Item>
				<xr:Item>AccumulationRegister.гз_ДвижениеНоменклатурыПоГодовомуПлану</xr:Item>
				<xr:Item>AccumulationRegister.гз_ТРУНераспределенные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_СтатусыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПредметаЗакупок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.гз_ВидыПредметовЗакупки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользованиеВидовПлановЗакупок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПланаЗакупок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_ВидыПлановЗакупок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/гз_АнализДоговора/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит значение признака ведения учета по спецификам 
Перем ВедениеУчетаПоСпецификам Экспорт; // признак учета по спецификам
// Хранит значение признака ведения учета закупок в разрезе складов 
Перем ВедениеУчетаЗакупокВРазрезеСкладов Экспорт; // признак учета закупок в разрезе складов


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Функция получает выборку документов регистраций договоров
//
// Возвращаемое значение:
//  Выборка из результата запроса
//  
Функция ПолучитьВыборкуРегистраций() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	гз_РегистрацияДоговораПоГосударственнымЗакупкам.Ссылка КАК Документ,
	               |	ЕСТЬNULL(гз_КорректировкиДоговоровГосударственныхЗакупокСрезПоследних.Сумма, гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.гз_РегистрацияДоговораПоГосударственнымЗакупкам КАК гз_РегистрацияДоговораПоГосударственнымЗакупкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам КАК гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам
	               |		ПО гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.ДоговорКонтрагента = гз_РегистрацияДоговораПоГосударственнымЗакупкам.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гз_КорректировкиДоговоровГосударственныхЗакупок.СрезПоследних(, ДоговорКонтрагента = &ДоговорКонтрагента) КАК гз_КорректировкиДоговоровГосударственныхЗакупокСрезПоследних
	               |		ПО гз_КорректировкиДоговоровГосударственныхЗакупокСрезПоследних.ДоговорКонтрагента = гз_РегистрацияДоговораПоГосударственнымЗакупкам.ДоговорКонтрагента
	               |ГДЕ
	               |	гз_РегистрацияДоговораПоГосударственнымЗакупкам.Проведен
	               |	И гз_РегистрацияДоговораПоГосударственнымЗакупкам.ДоговорКонтрагента = &ДоговорКонтрагента
	               |ИТОГИ
	               |	МАКСИМУМ(Сумма)
	               |ПО
	               |	ОБЩИЕ";
				   
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции //ПолучитьВыборкуРегистраций()

// Функция получает выборку документов регистраций поступлений по договорам
//
// Возвращаемое значение:
//  Выборка из результата запроса
//  
Функция ПолучитьВыборкуРегистрацийПоступлений() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок.Ссылка КАК Документ,
	               |	гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок.СуммаДокумента * ВЫБОР
	               |		КОГДА гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок.ВозвратПоставщику
	               |			ТОГДА -1
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Сумма
	               |ИЗ
	               |	Документ.гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок КАК гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок
	               |ГДЕ
	               |	гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок.Проведен
	               |	И гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок.ДоговорКонтрагента = &ДоговорКонтрагента
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	ОБЩИЕ";
				   
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции //ПолучитьВыборкуРегистрацийПоступлений()

// Функция получает выборку документов регистраций оплат по договорам
//
// Возвращаемое значение:
//  Выборка из результата запроса
//  
Функция ПолучитьВыборкуРегистрацийОплат() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	гз_ОплатаПоДоговорамГосударственныхЗакупок.Ссылка КАК Документ,
	               |	гз_ОплатаПоДоговорамГосударственныхЗакупок.СуммаДокумента КАК Сумма
	               |ИЗ
	               |	Документ.гз_ОплатаПоДоговорамГосударственныхЗакупок КАК гз_ОплатаПоДоговорамГосударственныхЗакупок
	               |ГДЕ
	               |	гз_ОплатаПоДоговорамГосударственныхЗакупок.Проведен
	               |	И гз_ОплатаПоДоговорамГосударственныхЗакупок.ДоговорКонтрагента = &ДоговорКонтрагента
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	ОБЩИЕ";
				   
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции //ПолучитьВыборкуРегистрацийОплат()

// Функция получает выборку документов поступлений по бухгалтерскому учету
//
// Возвращаемое значение:
//  Выборка из результата запроса
//  
Функция ПолучитьВыборкуПоступлений(РежимРаботы) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Если РежимРаботы = "БГУ" Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
		               |	ПоступлениеТоваровУслуг.СуммаДокумента КАК Сумма
		               |ИЗ
		               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		               |ГДЕ
		               |	ПоступлениеТоваровУслуг.Проведен
		               |	И ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента
		               |ИТОГИ
		               |	СУММА(Сумма)
		               |ПО
		               |	ОБЩИЕ";
    ИначеЕсли РежимРаботы = "БГП" ИЛИ РежимРаботы = "БК" ИЛИ РежимРаботы = "БУГП" Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
		               |	ПоступлениеТоваровУслуг.СуммаДокумента КАК Сумма
		               |ИЗ
		               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		               |ГДЕ
		               |	ПоступлениеТоваровУслуг.Проведен
		               |	И ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПоступлениеНМА.Ссылка,
		               |	ПоступлениеНМА.СуммаДокумента
		               |ИЗ
		               |	Документ.ПоступлениеНМА КАК ПоступлениеНМА
		               |ГДЕ
		               |	ПоступлениеНМА.Проведен
		               |	И ПоступлениеНМА.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВозвратТоваровПоставщику.Ссылка,
		               |	-ВозвратТоваровПоставщику.СуммаДокумента
		               |ИЗ
		               |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		               |ГДЕ
		               |	ВозвратТоваровПоставщику.Проведен
		               |	И ВозвратТоваровПоставщику.ДоговорКонтрагента = &ДоговорКонтрагента
		               |ИТОГИ
		               |	СУММА(Сумма)
		               |ПО
		               |	ОБЩИЕ";
    КонецЕсли;
				   
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции //ПолучитьВыборкуПоступлений()

// Функция получает выборку документов оплат по бухгалтерскому учету
//
// Возвращаемое значение:
//  Выборка из результата запроса
//  
Функция ПолучитьВыборкуОплат(РежимРаботы) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	Если РежимРаботы = "БГУ" Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	Заявка.Ссылка КАК Документ,
		               |	СУММА(0) КАК Сумма
		               |ИЗ
		               |	Документ.Заявка КАК Заявка
		               |ГДЕ
		               |	Заявка.Проведен
		               |	И Заявка.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Заявка.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	СчетКОплате.Ссылка,
		               |	СУММА(СчетКОплате.СуммаДокумента)
		               |ИЗ
		               |	Документ.СчетКОплате КАК СчетКОплате
		               |ГДЕ
		               |	СчетКОплате.Проведен
		               |	И СчетКОплате.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СчетКОплате.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка,
		               |	СУММА(-ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.СуммаПлатежа)
		               |ИЗ
		               |	Документ.ПлатежныйОрдерПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа
		               |ГДЕ
		               |	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		               |	И ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка,
		               |	СУММА(ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.СуммаПлатежа)
		               |ИЗ
		               |	Документ.ПлатежныйОрдерСписаниеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа
		               |ГДЕ
		               |	ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		               |	И ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка
		               |ИТОГИ
		               |	СУММА(Сумма)
		               |ПО
		               |	ОБЩИЕ";
    ИначеЕсли РежимРаботы = "БГП" ИЛИ РежимРаботы = "БК" ИЛИ РежимРаботы = "БУГП" Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка КАК Документ,
		               |	СУММА(ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.СуммаПлатежа) КАК Сумма
		               |ИЗ
		               |	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
		               |ГДЕ
		               |	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Проведен
		               |	И ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
		               |	СУММА(РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа)
		               |ИЗ
		               |	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
		               |ГДЕ
		               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
		               |	И РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
		               |	СУММА(-ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа)
		               |ИЗ
		               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
		               |ГДЕ
		               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
		               |	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка,
		               |	СУММА(-ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СуммаПлатежа)
		               |ИЗ
		               |	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
		               |ГДЕ
		               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Проведен
		               |	И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка,
		               |	СУММА(-ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.СуммаПлатежа)
		               |ИЗ
		               |	Документ.ПлатежныйОрдерПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа
		               |ГДЕ
		               |	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		               |	И ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка,
		               |	СУММА(ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.СуммаПлатежа)
		               |ИЗ
		               |	Документ.ПлатежныйОрдерСписаниеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа
		               |ГДЕ
		               |	ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		               |	И ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка
		               |ИТОГИ
		               |	СУММА(Сумма)
		               |ПО
		               |	ОБЩИЕ";
    КонецЕсли;
				   
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции //ПолучитьВыборкуПоступлений()

#Если Клиент Тогда

// Функция формирует бухгалтерские документы
//
Функция ОформитьПоступлениеБУ(Ссылка,Вид=Неопределено,Склад = Неопределено) Экспорт
	Возврат Ссылка.ПолучитьОбъект().ОформитьПоступлениеБУ(Ссылка);
КонецФункции //ОформитьПоступлениеБУ()

// Функция формирует бухгалтерские документы
//
Функция ОформитьПоступлениеОплатБУ(Ссылка,Вид=Неопределено) Экспорт
	Возврат Ссылка.ПолучитьОбъект().ОформитьПоступлениеБУ(Ссылка);    	
КонецФункции //ОформитьПоступлениеБУ()

// Процедура заполнения документа по документу-основанию
//
Функция  ЗаполнитьПоДокументуПоступленияБУ(Основание)  Экспорт
	мДокумент = Документы.гз_ПоступлениеТоваровРаботУслугПоДоговорамГосударственныхЗакупок.СоздатьДокумент();
	мДокумент.ЗаполнитьПоДокументуОснования(Основание);
	Возврат мДокумент;
КонецФункции //ЗаполнитьПоДокументуПоступленияБУ()

// Процедура заполнения документа по документу-основанию
//
Функция  ЗаполнитьПоДокументуОплатыБУ(Основание)  Экспорт
	мДокумент = Документы.гз_ОплатаПоДоговорамГосударственныхЗакупок.СоздатьДокумент();
	мДокумент.ЗаполнитьПоДокументуОснования(мДокумент,Основание);
	Возврат мДокумент;
КонецФункции //ЗаполнитьПоДокументуОснования()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ВедениеУчетаПоСпецификам  = Константы.гз_ВестиУчетПоСпецификам.Получить();
ВедениеУчетаЗакупокВРазрезеСкладов  = Константы.гз_ВестиУчетЗакупокВРазрезеМестПоставки.Получить();
